{
  "storyName": "A House with No Name",
  "storyParts": {
    "hall": {
      "name": "Hall",
      "slide": 2,
      "page1": [
        "It’s getting dark.",
        "And I’m starting to regret agreeing to meet a friend from school I haven’t seen or heard from in 15 years. Every thing will be alright though. We used to do everything together. Then we left school and they dropped off the face of the Earth. Fast forward to 3 weeks ago when they emailed me an invitation to attend their house out in the sticks. Why didn’t I just ignore it.",
        "It’s around 9PM in the middle of winter and I’m late, as always. I’m driving my old sedan through the woods, humming along to the tunes on the radio. The road is winding and narrow, lined either side by trees with a dense fog falling, reducing visibility to a few cars’ lengths. Not much further to go I think to myself as I turn on the fog lights.",
        "The radio flicks between static and pop songs. I look down and press the buttons on the radio to change the station, but they all seem to have bad signal. “Never mind”, I think as my eyes return to the road.",
        "Two people are in the middle of the road. I’m going to crash right into them. I pull the steering wheel with all my might, praying that I won’t hit them.",
        "It’s too late."
      ],
      "page2": [
        "The car slams into the person on the right-hand side and they roll up onto the bonnet and smash the windscreen. “Oh shit” I shout as I take my hands off the steering wheel and cover my face. The car slides off the road and crashes straight into a tree. I blackout.",
        "“I’m not dead” is all I think as I open my eyes and my mind slowly absorbs what’s happened.",
        "“Wait, where am I”. I sit up and feel a sharp jolt of pain down my right side and in my jaw. I wipe my mouth on my sleeve and see the deep claret stain I know only too well is blood. I’m in some sort of dimly lit entrance hall with an open plan staircase directly in front of me. On both the left and right hand side are large dark wooden doors set between wall mounted gas lamps and old dusty paintings of people I do recognise.",
        "I turn around and see large double doors which I assume must be the front door. I reach out and grab the large brass doorhandle and turn it. Locked and secure. It would take a battering ram to get through these. I’ll have to find another way out."
      ],
      "userOptions": {
        "option1": {
          "decision": "Staircase",
          "nextSlide": 4
        },
        "option2": {
          "decision": "Left Door",
          "nextSlide": 8
        },
        "option3": {
          "decision": "Right Door",
          "nextSlide": 6
        }
      }
    },
    "landing": {
      "name": "Landing",
      "slide": 4,
      "page2": [
        "I decide the best thing to do is to go up the stairs in front of me and see if I can see out of a window as to where the hell I am. I slowly move up the stairs one step at a time, each step creaking and threatening to break with every movement. I manage to get to the top safely and find myself on a landing that curves around the edge of the entrance hall.",
        "There is a door directly in front of me with a plaque on the front which reads “guest”. I turn around and see there is another door on the left of the landing. I feel like I'm being watched. I turn to the right and see an open door with complete darkness inside. I squint to try and see better. The door slams shut violently. I grip hold of the banister as a cold fear runs across my body."
      ],
      "userOptions": {
        "option1": {
          "decision": "Guest Door",
          "nextSlide": 26
        },
        "option2": {
          "decision": "Left Door",
          "nextSlide": 28
        },
        "option3": {
          "decision": "Right Door",
          "nextSlide": 30
        }
      }
    },
    "corridorRight": {
      "name": "Right Corridor",
      "slide": 6,
      "page2": [
        "I find myself in a dark corridor running perpendicularly with red wallpaper and wooden floors, faintly lit by gas lamps. There is a large window to my right. I try to open it, but it’s locked and pitch-black outside.",
        "The corridor has two doors off to the right and then proceeds round to the left. The doors are made from a dark wood and have bronze handles. I can feel a breeze and hear the whistling of the wind coming from under the first door. "
      ],
      "userOptions": {
        "option1": {
          "decision": "1st Door",
          "nextSlide": 18
        },
        "option2": {
          "decision": "2nd Door",
          "nextSlide": 20
        },
        "option3": {
          "decision": "Continue Along Corridor",
          "nextSlide": 22
        }
      }
    },
    "corridorLeft": {
      "name": "Left Corridor",
      "slide": 8,
      "page2": [
        "I find myself in a dark corridor running perpendicularly with red wallpaper and wooden floors, faintly lit by gas lamps. There is a large window to my left. I try to open it, but it’s locked and pitch-black outside.",
        "This corridor has two doors. One stands in front of me and the other is to the right. In the dimly lit distance the corridor seems to turn to the right. The doors are made from a dark wood and have bronze handles. The second door is slightly ajar, and I can hear a faint whimpering coming through it. It sends a shiver down my spine. I'm not sure I want to find out what that is."
      ],

      "userOptions": {
        "option1": {
          "decision": "1st Door",
          "nextSlide": 10
        },
        "option2": {
          "decision": "2nd Door",
          "nextSlide": 12
        },
        "option3": {
          "decision": "Continue Along Corridor",
          "nextSlide": 22
        }
      }
    },
    "diningRoom": {
      "name": "Dining Room",
      "slide": 10,
      "page2": [
        "I grab hold of the door handle and turn and it opens inwards. I find myself in some sort of dining room. There is a table in the middle of the room with two places set. There are windows on the left and opposite wall and a door on the right.",
        "I move around the table to try to windows but again they are locked. I look back to the table and feel a cold shiver run down my spine as I notice that there is place name in front of one of the seats. My name. I need to get out of here as soon as possible."
      ],
      "userOptions": {
        "option1": {
          "decision": "Side Door",
          "nextSlide": 12
        },
        "option2": {
          "decision": "Back To Corridor",
          "nextSlide": 22
        }
      }
    },
    "kitchen": {
      "name": "Kitchen",
      "slide": 12,
      "page2": [
        "I rush into the room and realise that the faint whimpering I heard earlier is louder and from behind a door in the far corner. I take a moment to consider where I am and realise I am in the kitchen. There are pots and pans all over the surfaces; all of which look like they have never been cleaned",
        "Next to the door in the corner is a window. I rush to it to try and open it but again have no luck. I feel a cold liquid seeping into my shoes like I have stepped in a puddle and look down to see my right foot is in what appears to be a pool of blood. The blood seemed to be coming from behind the door."
      ],
      "userOptions": {
        "option1": {
          "decision": "Small Bathroom",
          "nextSlide": 14
        }
      }
    },
    "toilet": {
      "name": "Toilet",
      "slide": 14,
      "page2": [
        "I nervously push open the corner door and find myself in a small bathroom. I gasp as I notice the entire floor is covered in blood. Opposite me is a half length mirror above a scaly sink with one of the taps dripping. To the left is a toilet covered in scum but it’s a dead end.",
        "There’s nothing else here and the only way out is the way I came. The whimpering I could hear in the previous room is gone and I realize my mind must have been playing tricks on me."
      ],
      "userOptions": {
        "option1": {
          "decision": "Return to previous room",
          "nextSlide": 16,
          "action": "death"
        }
      }
    },
    "kitchenDeath": {
      "name": "You ARE DEAD",
      "slide": 16,
      "page2": [
        "As I turn to go back into the kitchen, I once again hear the same whimpering noise but coming from directly behind me in the bathroom. I turn around as fast as I can. Standing infront of me is small girl with long black hair. I take a step backwards terrified and bump into the door. I'm trapped. She slowly starts to move her gaze upwards. I try to open the door frantically but it's locked. I look at her again and we make eye contact. I scream as all the life is sucked out of me.",
        "You are DEAD!!! RIP"
      ],
      "userOptions": {
        "option1": {
          "decision": "Return to beginning",
          "nextSlide": 2
        }
      }
    },
    "lounge": {
      "name": "Lounge",
      "slide": 18,
      "page2": [
        "I slowly open the door and look inside. It appears to be a lounge with an old CRT tv set in the opposite corner playing static and a couple of big arm chairs in front of the tv with their back to me. There are animals head set upon all of the walls. I feel incredibly uneasy as the eyes of the elk, the bull, the bear and other animals all seemed to be looking directly at me.",
        "Then I notice it. There is a big sliding window behind the tv set with thick dusty curtains set apart. The window is open and the curtains are moving with the breeze. My heart starts thumping as I made my way towards the window. I’m finally getting out of here.",
        "A noise behind me. I freeze in my spot and slowly turn back to see a grizzled and misshapen man asleep and snoring in the left armchair. He is wearing dungarees and a baseball cap and his one eye is closed. The other is missing entirely and is an empty socket. On his waistband is a big iron key. I am about 3 metres from the window and the same from him."
      ],
      "userOptions": {
        "option1": {
          "decision": "Take the key and leave the room!",
          "nextSlide": 6,
          "action": "key"
        },
        "option2": {
          "decision": "Do I tiptoe to the window and try and climb out?",
          "nextSlide": 38,
          "action": "death"
        }
      }
    },
    "study": {
      "name": "Study",
      "slide": 20,
      "page2": [
        "I push the door open and go inside. It appears to be some kind of study with book shelves along all four walls and a desk in the middle of the room with a chair behind. “Wait a second” I think. I can use the chair to smash through a window. Buoyed by this idea, I move towards the chair. Its a wooden framed desk chair with a cushion sewn on. I grab it with both hands and try and lift it but it won’t move.",
        "I try with all my might but I cannot move the chair even slightly. I look at it, bemused, trying to work out what is holding it down but there appears to be nothing. I try one last time and put both of my hand on the back of the chair and heave. Nothing. All of a sudden the books shelves behind me start shaking. I turn and look at them and they start shaking even more.",
        "From the middle shelf an arm starts to come from between two of the books and reaches towards me. I stumble backwards and fall over the chair."
      ],
      "userOptions": {
        "option2": {
          "decision": "Get up and run",
          "nextSlide": 44,
          "action": "death"
        }
      }
    },
    "basementCorridor": {
      "name": "Rear Corridor",
      "slide": 22,
      "page2": [
        "I move to the end of the corridor and follow it around the bend. I can see the corridor continues around the other side of the house. However halfway down the corridor is a sheet metal door with a large catch. It looks as if it might lead to a basement."
      ],
      "userOptions": {
        "option1": {
          "decision": "Go to corridor left",
          "nextSlide": 8
        },
        "option2": {
          "decision": "Go to corridor right",
          "nextSlide": 6
        },
        "option3": {
          "decision": "Basement",
          "nextSlide": 24
        }
      }
    },
    "basement1": {
      "name": "Basement Entrance",
      "slide": 24,
      "page2": [
        "I use all my strength to open the large metal door and slip inside. I’m faced with wooden steps leading down into a basement. There’s a large gap between the first step and the next step with the ones in between all broken. There’s a flickering light at the bottom of the stairs but its virtually impossible to see."
      ],
      "userOptions": {
        "option1": {
          "decision": "Continue forward?",
          "nextSlide": 32,
          "action": "keycheck"
        },
        "option2": {
          "decision": "Retrace steps?",
          "nextSlide": 22
        }
      }
    },
    "guestRoom": {
      "name": "Guest Room",
      "slide": 26,
      "page1": [
        "I push into the room with the “guest” sign on the front. Surely there must be a window to jump out of or something up here. The “guest” room is bare except for a single chair sitting in the middle of the room. The chair is made from metal and is bolted to the floor. Behind the chair is a window that has metal bars across it.",
        "A massive thud in the back of my head and I gasp and fall forwards, eyes rolling into the back of my head.  Through hazy eyes on the floor, I see a man standing over me and I pass out. This is the end.",
        "My eyes jolt open and I’m panting hard as if I’ve just been pulled out of an icy lake seconds before drowning. “Where’s that man?”- I think to myself. It suddenly dawns on me that I am no longer lying on the floor but instead I’m sitting in the metal seat. My left wrist is secured to the chair by a steel clasp as is my neck. I pull at both, but neither will move."
      ],
      "page2": [
        "A bright red light appears in front of me. I cover my eyes with my right hand as they acclimatise. A few seconds later, I realise it’s not just a light but a large timer which reads 5:00. And then it starts counting down. 4:59, 4:58, 4:57. “What the hell does this mean” I think. I start to panic. 4:50, 4:49, 4:48. I pull at the braces again but nothing. I look around the room frantically. And then I see it. Has it always been there? A large cleaver sits on a small side table to my right. Next to it a note with the words.",
        "“To leave, you must leave”.",
        "What the hell does that mean. I pick up the cleaver and start banging at the clasp holding my left wrist. Nothing is working. 4:02, 4:01, 4:00. “Arghhhh” I explain as the next clasp tightens and starts to constrict my breathing."
      ],
      "userOptions": {
        "option1": {
          "decision": "Try and break the clasp with the cleaver",
          "nextSlide": 40,
          "action": "death"
        },
        "option2": {
          "decision": "Cut off left hand and take cleaver",
          "nextSlide": 46
        }
      }
    },
    "bedroom1": {
      "name": "Bedroom 1",
      "slide": 28,
      "page2": [
        "I slowly push open the door that I’ve just seen slam shut. Why do I choose to go this way. No way. Is that my old friend? I peak through a crack in the door and can see a middle aged women with long straight brown hair sitting in front of a dressing table. She’s wearing a long white and wore out dress and is looking into the mirror brushing her hair. I open the door a little wider to get a better view. It’s definitely my friend but what the hell are they doing in this house. I need to get out."
      ],
      "userOptions": {
        "option1": {
          "decision": "Go into the bedroom and speak to your old friend",
          "nextSlide": 34,
          "action": "death"
        }
      }
    },
    "bedroom2": {
      "name": "Bedroom 2",
      "slide": 30,
      "page2": [
        "I open the door gradually and find myself in a huge bedroom. There’s a dusty bed with dark brown bedding in the centre of the room with a closet opposite and a chest of draws in the corner. Across the bed on the opposite side of the room are double doors with glass panes leading out onto a balcony.",
        "I run to the doors. They’re open. I swing one back and take a step forward and I feel someone grab the back of my clothes and pull me back in. It’s the grizzled one-eyed man wearing dungarees with patches of hair on his head."
      ],
      "userOptions": {
        "option2": {
          "decision": "Run",
          "nextSlide": 4
        },
        "option3": {
          "decision": "Fight without cleaver ",
          "nextSlide": 16,
          "action": "death"
        }
      }
    },
    "basement2": {
      "name": "Basement",
      "slide": 32,
      "page2": [
        "I put one foot on the top step and apply a little bit of pressure to test whether it will break. A few prods and it feels fine. I walk forward onto the first step and instantly it snaps and I’m falling forward. I put my arms out and smash into the ground and can hear my left wrist snap. I bite my lip so hard trying not to scream that it starts bleeding.",
        "I stagger to my feet and look around. I can barely see anything but there are 2 lamps which are illuminating a couple of areas. The first appears to be some kind of cage. I step closing to it and see that it’s around 3 foot tall and 6 feet wide but it’s empty. The other area I can see appears to be some kind of trap door with a large metal padlock attached. I go to the padlock and try and force it off but its too strong.. There must be a key somewhere but how am I going to get out of here.",
        "Something growls in the dark and I turn and see you bright orange eyes staring at me from the darkness."
      ],
      "userOptions": {
        "option1": {
          "decision": "Use key to escape under pressure",
          "nextSlide": 36
        },
        "option2": {
          "decision": "Attempt escape without key",
          "nextSlide": 42,
          "action": "death"
        }
      }
    },
    "friendDeath": {
      "name": "Bedroom with Friend",
      "slide": 34,
      "page2": [
        "I take one step into the room and she stops brushing her hair. Her head starts turning to the right and keeps rotating all the way to look at me on the left. Her eyes are pitch black. He mouth appears to fall 3 inches and she vanishes. I turn to run but she’s standing in front of me, her hand is pushed into my chest and I’m bleeding heavily. RIP you are dead"
      ],
      "userOptions": {
        "option1": {
          "decision": "Play Again?",
          "nextSlide": 2
        }
      }
    },
    "win": {
      "name": "You Have Escaped!",
      "slide": 36,
      "page2": [
        "You Have Won!"
      ],
      "userOptions": {
        "option1": {
          "decision": "Play Again?",
          "nextSlide": 2
        }
      }
    },
    "hillbillyDeath": {
      "name": "Escape attempt",
      "slide": 38,
      "page2": [
        "I tiptoe to the window and puts my hands on the windowsill readying myself to jump when I hear the loud whirring of a chainsaw. I cough and blood pours out of my mouth. I look down and see the top off a chainsaw protruding out of my stomach. My vision goes blurry.", 
        "RIP. You are dead"
      ],
      "userOptions": {
        "option1": {
          "decision": "Play Again?",
          "nextSlide": 2
        }
      }
    },
    "sawDeath": {
      "name": "You are dead!",
      "slide": 40,
      "page2": [
        "I try with all my might to break the clasp around my wrist as the clasp around my neck gets tighter and tighter. I can see the red countdown clock slowly ticking down. It counts down from 10 as my windpipe closes and I gasp my last breath",
        "RIP. You are dead."
      ],
      "userOptions": {
        "option1": {
          "decision": "Play Again?",
          "nextSlide": 2
        }
      }
    },
    "basementDeath": {
      "name": "You are dead!",
      "slide": 42,
      "page2": [
        "I put my hands on the thick iron lock and realise that there is nothing I can do. The beast is blocking my way backwards and this lock is blocking my way forwards. A tear runs down my face as I fall to my knees resigned to the fact that this is the end. The beast starts to run towards me and I shut my eyes.",
        "RIP. You are dead."
      ],
      "userOptions": {
        "option1": {
          "decision": "Play Again?",
          "nextSlide": 2
        }
      }
    },
    "bookcaseDeath": {
      "name": "You are dead!",
      "slide": 44,
      "page2": [
        "I try to get up and run but I can't. A fear has gripped me like nothing I've felt before. From the bookcase, a ghoulish face appears and my heart stops. This is the end.",
        "RIP. You are dead."
      ],
      "userOptions": {
        "option1": {
          "decision": "Play Again?",
          "nextSlide": 2
        }
      }
    },
    "cleaverFight": {
      "name": "Bedroom 2",
      "slide": 46,
      "page2": [
        "I open the door to the next room and find myself in a huge bedroom. There’s a dusty bed with dark brown bedding in the centre of the room with a closet opposite and a chest of draws in the corner. Across the bed on the opposite side of the room are double doors with glass panes leading out onto a balcony.",
        "I run to the doors. They’re open. I swing one back and take a step forward and I feel someone grab the back of my clothes and pull me back in. It’s the grizzled one-eyed man wearing dungarees with patches of hair on his head."
      ],
      "userOptions": {
        "option1": {
          "decision": "Run",
          "nextSlide": 4
        },
        "option2": {
          "decision": "Fight with the cleaver",
          "nextSlide": 36
        }
      }
    }
  }
}
